[ReaperCryptic X2SoldierClassTemplate]
DisplayName="死神织梦人"
ClassSummary="利用微妙而超自然的力量，织梦人在阴影中提供支援。"
AbilityTreeTitles[0]="暗影之源"
AbilityTreeTitles[1]="无形之息"
AbilityTreeTitles[2]="诡秘之语"
AbilityTreeTitles[3]="XCOM"

RandomNickNames[0]="低语者"
RandomNickNames[1]="私语者"
RandomNickNames[2]="细语者"
RandomNickNames[3]="谣言者"
RandomNickNames[4]="谜语者"
RandomNickNames[5]="秘典者"
RandomNickNames[6]="幻面者"
RandomNickNames[7]="多米诺"
RandomNickNames[8]="幽灵"
RandomNickNames[9]="骚灵"
RandomNickNames[10]="缠绕者”"
RandomNickNames[11]="棋局大师"

RandomNickNames_Male[0]="夜王"
RandomNickNames_Male[1]="暗黑王子"
RandomNickNames_Male[2]="祖尔"

RandomNickNames_Female[0]="女妖"
RandomNickNames_Female[1]="夜后"
RandomNickNames_Female[2]="暗黑公主"

+RankNames[0]="新兵"
+RankNames[1]="入门者"
+RankNames[2]="学徒"
+RankNames[3]="熟练者"
+RankNames[4]="门徒"
+RankNames[5]="神秘者"
+RankNames[6]="术士"
+RankNames[7]="大法师"

+ShortNames[0]="新兵"
+ShortNames[1]="入门者"
+ShortNames[2]="学徒"
+ShortNames[3]="熟练者"
+ShortNames[4]="门徒"
+ShortNames[5]="神秘者"
+ShortNames[6]="术士"
+ShortNames[7]="大法师"

+RankIcons[0]= "UILibrary_Common.rank_rookie"
+RankIcons[1]= "UILibrary_Common.psirank_initiate"
+RankIcons[2]= "UILibrary_Common.psirank_acolyte"
+RankIcons[3]= "UILibrary_Common.psirank_adept"
+RankIcons[4]= "UILibrary_Common.psirank_disciple"
+RankIcons[5]= "UILibrary_Common.psirank_mystic"
+RankIcons[6]= "UILibrary_Common.psirank_warlock"
+RankIcons[7]= "UILibrary_Common.psirank_magus"